# `pandas` tutorial for my penguin

`numpy`不好处理字符串信息、不好处理标题和标签、不好处理缺失信息。`pandas`是设计给金融和社会科学工作者、用来处理表格信息的。

In [8]:
import pandas as pd
import numpy as np

## Series

In [15]:
data = pd.Series(np.random.randint(low=0, high=100, size=10))
data

0    31
1     0
2    54
3    64
4    10
5    32
6    84
7    32
8    74
9    77
dtype: int64

In [16]:
data.values

array([31,  0, 54, 64, 10, 32, 84, 32, 74, 77])

In [17]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [22]:
# index is very important in pandas
data = pd.Series([18, 19, 20, 21], index=['x', 'y', 'z', 't'])
print(data['x'])
data

18

x    18
y    19
z    20
t    21
dtype: int64

In [29]:
pop_dict = {'California': 38332521,
           'Texas': 26448193,
           'New York': 19651127,
           'Florida': 19552860,
           'Illinois': 12882135}

In [25]:
pop_dict['California']

38332521

In [28]:
data = pd.Series(pop_dict)
print(data['California'])
data

38332521

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

## Index

In [90]:
# immutable array
ind = pd.Index([2, 3, 5, 7, 11])

In [92]:
ind[1:3]

Int64Index([3, 5], dtype='int64')

In [93]:
ind[0] = 100

TypeError: Index does not support mutable operations

## Dataframe

In [85]:
df = pd.DataFrame(pd.Series(pop_dict))
df

                   0
California  38332521
Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135

In [96]:
df = pd.DataFrame(pd.Series(pop_dict), columns=['population'])
df

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [87]:
pd.DataFrame([{'a': 1, 'b': 2}, {'c':3, 'd': 4}])

     a    b    c    d
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

In [100]:
'Texas' in df.index

True

In [101]:
df['California':'New York']

            population
California    38332521
Texas         26448193
New York      19651127

In [103]:
df[0:2]

            population
California    38332521
Texas         26448193

loc, and iloc

In [152]:
A = pd.Series([2, 4, 6], index=[0, 1, 2]) 
B = pd.Series([1, 3, 5], index=[1, 2, 3]) 
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [153]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [159]:
A = np.random.randint(10, size=(4, 5))

In [160]:
A

array([[5, 2, 5, 2, 8],
       [8, 4, 1, 5, 2],
       [5, 0, 3, 4, 1],
       [7, 5, 2, 4, 9]])

In [165]:
df = pd.DataFrame(A, columns=list('ABCDE'), index=[1, 3, 5, 6])
df

   A  B  C  D  E
1  5  2  5  2  8
3  8  4  1  5  2
5  5  0  3  4  1
6  7  5  2  4  9

In [170]:
df.loc[1]['A'], df.iloc[1]['A']

(5, 8)

In [175]:
df.subtract(df.loc[1], axis=1)

   A  B  C  D  E
1  0  0  0  0  0
3  3  2 -4  3 -6
5  0 -2 -2  2 -7
6  2  3 -3  2  1

In [179]:
df['A'][1] = np.nan
df

     A  B  C  D  E
1  NaN  2  5  2  8
3  8.0  4  1  5  2
5  5.0  0  3  4  1
6  7.0  5  2  4  9

In [188]:
df.notnull()

       A     B     C     D     E
1  False  True  True  True  True
3   True  True  True  True  True
5   True  True  True  True  True
6   True  True  True  True  True

In [ ]:
df.dropna(axis='columns', how='all')
df.dropna(axis='row', thresh=2)

In [197]:
# Multi-index
mind = pd.MultiIndex.from_arrays([['CA', 'NY', 'TX', 'CA', 'NY', 'TX'], 
                                  [2000, 2000, 2000, 2010, 2010, 2010]])
mind

MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 1, 2, 0, 1, 2], [0, 0, 0, 1, 1, 1]])

In [207]:
pop = pd.Series([33871648, 37253956, 18976457, 19378102, 20851820, 25145561], 
                index=[['CA', 'NY', 'TX', 'CA', 'NY', 'TX'], 
                       [2000, 2000, 2000, 2010, 2010, 2010]])
pop

CA  2000    33871648
NY  2000    37253956
TX  2000    18976457
CA  2010    19378102
NY  2010    20851820
TX  2010    25145561
dtype: int64

In [205]:
pop.unstack().stack()

CA  2000    33871648
    2010    19378102
NY  2000    37253956
    2010    20851820
TX  2000    18976457
    2010    25145561
dtype: int64

In [206]:
pop.reindex(mind)

CA  2000    33871648
NY  2000    37253956
TX  2000    18976457
CA  2010    19378102
NY  2010    20851820
TX  2010    25145561
dtype: int64

In [219]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
data = pd.Series(data)
data

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [220]:
data.index.names = ['state', 'year']
data

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [222]:
data.index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 2, 2, 1, 1], [0, 1, 0, 1, 0, 1]],
           names=['state', 'year'])

opinion off:
    
donor pay the bill, assumption was wrong
another part otf the campus to play

coworker, design 

look cooler

first, 50 support

senior: focus on interior

coworker changed, don't want to be outside a team
    
The speaker was the only one 

stay with the current design

compatitor improved the design

Mary: volunteer kids

drive to zoo tomorrow, rent a van, too late

kids will be disappoint

friends: borrow two cars, find somebody else to drive

public trans: bus, challenge to supervise them on the bus

pyschology math capability of baby

intellectual ability of baby

5 month can do arithmetic: 1+1=2
evidence was indirect

experiment: a dull on the table, lower a screen to shield, place a second dull behind the screen. 

Raise screen, baby was surprised! how to tell: eye movement, stared at the screen.

In [227]:
640

640

In [224]:
613 * 2 # Sapporo -- Toyko
640 # one night in Osaka

1226

In [226]:
63.94 + 39.26

103.19999999999999

In [232]:
pd.*delta?

pd.Timedelta
pd.to_timedelta

In [228]:
pd.__version__

'0.23.4'

In [129]:
df = pd.read_csv('./1846315375.csv')[:10]

In [130]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [131]:
df.columns

Index(['id', 'bid', '正文', '原始图片url', '视频url', '位置', '日期', '工具', '点赞数', '评论数',
       '转发数', '话题', '@用户', '是否原创', '源用户id', '源用户昵称', '源微博id', '源微博bid',
       '源微博正文', '源微博原始图片url', '源微博视频url', '源微博位置', '源微博日期', '源微博工具', '源微博点赞数',
       '源微博评论数', '源微博转发数', '源微博话题', '源微博@用户'],
      dtype='object')

In [132]:
df = df[['日期', '点赞数', '评论数', '转发数', '位置', '@用户', '是否原创']]

In [189]:
df['转评赞'] = df['点赞数'] + df['评论数'] + df['转发数']

In [190]:
df

     A  B  C  D  E  转评赞
1  NaN  2  5  2  8   10
3  8.0  4  1  5  2    1
5  5.0  0  3  4  1   15
6  7.0  5  2  4  9    4

In [73]:
df['@用户'].values[0] == 'nan'

False

In [66]:
~np.isnan()

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

In [63]:
account_list = [a.split(',') for a in list(df['@用户'].values)[1:]]

AttributeError: 'float' object has no attribute 'split'

In [60]:
account_list = [j for i in account_list for j in i]

In [62]:
len(account_list)

542